27-auth/app/views/students/show.erb

<ul>
<% @student.favorites.each do |fave_var| %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."student_id" = ? ORDER BY priotity_level DESC  [["student_id", 14]]