23-rails-associations/the-code-bending-dictionary/app/controllers/favorites_controller.rb

    def new
        @favorite = Favorite.new
        @students = Student.all
        @words = Word.all
---
SELECT "students".* FROM "students"
SELECT "words".* FROM "words"

    def create
        # byebug
        favorite_params = params.require(:favorite).permit(:priority_level, :student_id, :word_id)
        @favorite = Favorite.create(favorite_params)

        student = Student.find(params[:favorite][:student_id])
---
INSERT INTO "favorites" ("priority_level", "student_id", "word_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["priority_level", 5], ["student_id", 15], ["word_id", 7], ["created_at", "2020-08-27 18:33:43.609512"], ["updated_at", "2020-08-27 18:33:43.609512"]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]