23-rails-associations/the-code-bending-dictionary/app/controllers/words_controller.rb

    def index
      @words = Word.all
---
SELECT "words".* FROM "words"

    def destroy
      @word.destroy
---
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 2]]

    def get_word
      @word = Word.find(params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]