26-cookies-session/app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students" ORDER BY  DESC first_name

  def create
  @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "age", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @student.update(student_params)
---
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 2093478999], ["updated_at", "2020-08-26 19:19:17.642975"], ["id", 6]]

  def get_student
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]