23-rails-associations/the-code-bending-dictionary/app/views/students/show.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."student_id" = ? ORDER BY priotity_level DESC  [["student_id", 14]]
---
<ul>
<% @student.favorites.each do |fave_var| %>