27-auth/app/controllers/students_controller.rb

  def handle_login
    @student = Student.find_by(first_name: params[:first_name])
---
SELECT "students".* FROM "students" WHERE "students"."first_name" = ? ORDER BY "students"."first_name" ASC LIMIT ?  [["first_name", "Eric"], ["LIMIT", 1]]

  def index
    @students = Student.all
---
SELECT "students".* FROM "students" ORDER BY  DESC first_name

  def create
  @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Isabel"], ["last_name", "Lee"], ["age", 29048756438375469], ["created_at", "2020-08-26 19:11:03.394499"], ["updated_at", "2020-08-26 19:11:03.394499"]]

  def update
    @student.update(student_params)
---
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 2093478999], ["updated_at", "2020-08-26 19:19:17.642975"], ["id", 6]]

  def get_student
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]