21-crud-in-rails/lecture_kit/the-code-bending-dictionary/app/controllers/students_controller.rb

    def index
        # digesting the request: it reaches out to the model to get an array of all students
        @students = Student.all
---
SELECT "students".* FROM "students"

    def create
        # byebug
        # digesting the request: working with params
        student_params = params.require(:student).permit(:first_name, :last_name, :age)
        @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Isabel"], ["last_name", "Lee"], ["age", 29048756438375469], ["created_at", "2020-08-26 19:11:03.394499"], ["updated_at", "2020-08-26 19:11:03.394499"]]

    def show
        # digesting the request: it reaches out to the model to get a specific Student instance
        @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def edit
        # digesting the request: crompiling data for the form from the model
        @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    # digesting the request: going through the params hash and checking in with the model to update a the instance
    @student = Student.find(params[:id])
    student_params = params.require(:student).permit(:first_name, :age, :last_name)
    @student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 2093478999], ["updated_at", "2020-08-26 19:19:17.642975"], ["id", 6]]

  def destroy
    # digesting the request: checking in with the model to find a student instance and destroy it
    @student = Student.find(params[:id])
    Student.destroy(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]