25-validations/the-code-bending-dictionary/app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY  DESC first_name
---
  def index
    @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["created_at", "2020-08-31 17:36:14.433530"], ["updated_at", "2020-08-31 17:36:14.433530"]]
---
  def create
    # byebug
    #if the student instance is created and is valid, redirect to the students_path
      @student = Student.create(student_params)

UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 2093478999], ["updated_at", "2020-08-26 19:19:17.642975"], ["id", 6]]
---
  def update
    @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def get_student
    @student = Student.find(params[:id])